/*
Часть 1:
Написать программу, которая принимает размер поля для игры в крестики нолики X O и генерирует его


* Input:
* 3 3
* Output:
*  --- --- --- 
* |   |   |   | 
*  --- --- ---  
* |   |   |   | 
*  --- --- ---  
* |   |   |   | 
*  --- --- ---

Часть 2:
Написать программу, которая принимает игровое поле и выводит победил пользователь или нет. В данном случае 1-x 2-0 0-пустое значение.

* Initial data: 
* [[1, 2, 0],
* [2, 1, 0],
* [2, 1, 1]] 
* Output:
* Победил игрок 1

Часть 3:
Написать программу, которая принимает размер поля для игры в крестики нолики X O, генерирует его. 
После чего циклично ожидает хода игроков. 
При каждом ходе проверяется победил ли игрок.

Часть 4:
Написать программу генератор пароля 4-12 символов, разный регистр, спецсимволы [пример функционала генератора паролей](https://passwordsgenerator.net/)

Доп. задание:
Исключить из результатов сгенерированных паролей, пароли которые указаны в массиве из наиболее часто встречающихся ["qwerty", "123456", "pass", "password"]

Часть 5:
Написать программу генератор кроссворд. На входе принимается массив слов, на выходе текстовая реализация кроссворда.

* Input:
* JAVA
* HASKELL
* KOTLIN
* PYTHON
* Output:
*        4 
*        P 
*   2    Y 
*   H    T 
* 1JAVA  H 
*   S    O 
*  3KOTLIN 
*   E      
*   L      
*   L      
          
*/

public class TaskExtra {
  public static void main(String args[]) {
    
  }
}