/*
Задание 3

Написать любую операцию на сравнение двух переменных, 
к примеру 
    весКота=5 
    весСобаки=8 
    если весКота меньше весСобаки, выводим: кота нужно меньше кормить.

* Output:
* Кота нужно меньше кормить.

Доп задание:
Дополнить программу возможностью ввода веса кота и собаки (Или своего условия)


* Output:
* Введите вес кота: 
* Введите вес собаки:
* Результат: собаку нужно меньше кормить

*/

public class Task3 {
  public static void main(String args[]) {
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/2.9.php
https://metanit.com/java/tutorial/2.14.php
https://metanit.com/java/tutorial/2.5.php

*/