/*
Задание 6

Часть 1:
Инициализация и вывод массива. Создайте массив из 5 чисел и выведите их на экран

* Output:
* 1
* 2
* 3
* 4
* 5

Часть 2:
Сумма элементов массива. Напишите программу, которая вычисляет сумму всех элементов массива из 10 чисел


* Массив 3, 5, 4, 2, 6, 34, 1, 4, 33, 22
* Output:
* Сумма всех элементов массива равна: 114

Часть 3:
Поиск максимального элемента. Напишите программу, которая находит максимальный элемент в массиве из 5 чисел.

* Массив 3, 56, 76, 86, 33
* Output:
* Максимальный элемент массива: 86

Дополнительное задание 1:
Заполнение массива случайными числами. Создайте массив из 10 случайных чисел в диапазоне от 1 до 100 и выведите его на экран.

* Output:
* 98
* 37
* 79
* 49
* 2
* 4
* 16
* 61
* 45
* 40

Дополнительное задание 2:
Подсчет четных и нечетных чисел. Напишите программу, которая подсчитывает количество четных и нечетных чисел в массиве из 10 чисел.

* Массив 12, 3, 5, 8, 9, 14, 17, 22, 31, 6
* Output:
* Четные числа: 5
* Нечетные числа: 5

*/

public class Task6 {
  public static void main(String args[]) {
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/2.4.php
https://metanit.com/python/tutorial/6.1.php

*/