/*
Задание 4

Программа принимает на вход целое число. 
Определяет, является ли число отрицательным, нулем или положительным. 
Выводит соответствующее сообщение для каждого случая.


* Input:
* -8
* Output:
* Введите целое число: -8
* Число отрицательное

Доп задание:
Использовать условный оператор switch.


* Input:
* 12
* Output:
* Введите целое число: 12
* Число положительное

Доп задание:
Проверяем, является ли число четным или нечетным.


* Input:
* 12
* Output:
* Введите целое число: 12
* Число положительное и четное.
*/


public class Task4 {
  public static void main(String args[]) {
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/2.14.php
https://metanit.com/java/tutorial/2.5.php
https://metanit.com/java/tutorial/2.3.php

*/