/*
Задание 5

Часть 1:
Вывести числа от 1 до 10 используя цикл for

* Output:
* 1
* 2
* 3
* 4
* 5
* 6
* 7
* 8
* 9
* 10

Часть 2:
Вывести сумму чисел от 1 до n используя цикл while

* Input:
* 10
* Output:
* Введите число n: 10
* Сумма чисел от 1 до n= 10 равна 55

Часть 3:
Вывести таблицу умножения для определенного числа, например 8

* Output:
* 8 * 1 = 8
* 8 * 2 = 16
* 8 * 3 = 24
* 8 * 4 = 32
* 8 * 5 = 40
* 8 * 6 = 48
* 8 * 7 = 56
* 8 * 8 = 64
* 8 * 9 = 72
* 8 * 10 = 80

Доп задание 1:
Вместо заданного числа, использовать число введенное пользователем

* Input:
* 5
* Output:
* 5 * 1 = 5
* 5 * 2 = 10
* 5 * 3 = 15
* 5 * 4 = 20
* 5 * 5 = 25
* 5 * 6 = 30
* 5 * 7 = 35
* 5 * 8 = 40
* 5 * 9 = 45
* 5 * 10 = 50

Доп задание 2:
Используя циклы выведите последовательность Фибоначчи для первых 10 чисел
https://ru.wikipedia.org/wiki/Числа_Фибоначчи

*Output:
* 0 1 1 2 3 5 8 13 21 34

Доп задание 3:
Посчитайте сумму четных чисел 45398345690876453780436789, доп. балл если вместо текущего числа используется число введенное пользователем

* Output:
* Сумма четных цифр: 66

*/


public class Task5 {
  public static void main(String args[]) {
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/2.6.php

*/
