/*
Задание 7

Часть 1:
Создание и вывод списка имен. Создайте список из 5 имен (строк) и выведите их на экран.

* Initial data: 
* List  ["Андрей", "Татьяна", "Елена", "Михаил", "Роман"]
* Output:
* Андрей
* Татьяна
* Елена
* Михаил
* Роман

Часть 2:
Подсчет элементов в списке. Создайте список из нескольких чисел и посчитайте количество элементов в нем.

* Initial data: 
* List  ["Андрей", "Татьяна", "Елена", "Михаил", "Роман"]
* Output:
* Количество элементов в списке: 5

Часть 3:
Обратный вывод списка. Создайте список из нескольких строк и выведите их в обратном порядке. 

* List  ["Андрей", "Татьяна", "Елена", "Михаил", "Роман"]
* Output:
* Роман
* Михаил
* Елена
* Татьяна
* Андрей

Часть 4:
Проверка на существование элемента в списке. Напишите программу, которая проверяет, содержится ли заданное число в списке.

* Initial data:
* List [33, 445, 656, 7657, 877, 323]
* Input: 
* 33
* Output:
* Число 33 содержится в списке.
*/

public class Task7 {
  public static void main(String args[]) {
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/5.1.php
https://metanit.com/java/tutorial/5.2.php
https://metanit.com/java/tutorial/5.3.php

*/