/*
Задание 9

Часть 1:
Класс человек. Создайте класс, где описываются свойства объекта. (Человек, группа студентов, книги, машины...) 
Например человека, в котором содержатся поля: имя, возраст и адрес. Добавьте метод для вывода информации о человеке.

* Output:
* Фамилия и Имя: Иванов Иван
* Возраст: 20
* Группа: ИО01

Часть 2:
Геометрическая фигура. Создайте класс одного из типов Square, Rectangle, Triangle или Circle, описывающий размеры сторон. 
Добавьте метод вычисления, площади и периметра фигуры.

* Initial data: 
* Rectangle(1, 2)
* Output:
* Площадь равна 2cm2
* Периметр равен 6см

Часть 3:
Метод для проверки простого числа. Напишите метод, который принимает целое число и возвращает true, если число является простым, и false в противном случае. Используйте цикл for для проверки делителей.

* Input:
* 3
* Output:
* Число 3 простое: true

Часть 4*:
Метод для подсчета суммы четных чисел в массиве. Напишите метод, который принимает массив целых чисел и возвращает сумму всех четных чисел в этом массиве, используя цикл for.

* Initial data:
* List [2, 3, 5 , 8, 7, 10]
* Output:
* Сумма четных чисел: 20

*/

public class Task9 {
  public static void main(String args[]) {
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/3.1.php

*/