/*
Задание 8

Часть 1:
Метод для вывода чисел от 1 до n. Напишите метод, который принимает целое число n и выводит все числа от 1 до n с использованием цикла for.

* Output:
* 1
* 2
* 3
* 4
* 5
* 6
* 7
* 8
* 9
* 10

Часть 2:
Метод для вычисления факториала числа. Напишите метод, который принимает целое число n и возвращает его факториал, используя цикл for.

* Input:
* 3
* Output:
* Факториал 3 равен 6

Часть 3:
Метод для проверки простого числа. Напишите метод, который принимает целое число и возвращает true, если число является простым, и false в противном случае. Используйте цикл for для проверки делителей.

* Input:
* 3
* Output:
* Число 3 простое: true

Часть 4*:
Метод для подсчета суммы четных чисел в массиве. Напишите метод, который принимает массив целых чисел и возвращает сумму всех четных чисел в этом массиве, используя цикл for.

* Output:
* Initial data:
* List [2, 3, 5 , 8, 7, 10]
* Output:
* Сумма четных чисел: 20

Часть 5*:
Метод для вывода таблицы умножения. Напишите метод, который принимает число и выводит таблицу умножения для этого числа от 1 до 10, используя цикл for.

* Input: 
* 5
* Output:
* 5 * 1 = 5
* 5 * 2 = 10
* 5 * 3 = 15
* 5 * 4 = 20
* 5 * 5 = 25
* 5 * 6 = 30
* 5 * 7 = 35
* 5 * 8 = 40
* 5 * 9 = 45
* 5 * 10 = 50

*/

public class Task8 {
  public static void main(String args[]) {
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/3.1.php

*/