/*
Задание 1

Напишите вывод строки HelloWorld

* Output:
* Hello, World!

Доп задание:
Замените текст на ФИ и группу


* Output:
* Иванов Иван ИВ01
*/

public class Task1 {
  public static void main(String args[]) {
    System.out.println("Hello Java!");
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/2.11.php
https://metanit.com/java/tutorial/2.9.php

*/