/*
Задание 2

Вывести информацию о студенте используя не единую строку, 
а отдельные переменные содержащие информацию о студенте ФИО/Возраст/Группа.

* Output:
* Имя: Иван, Фамилия: Иванов, Возраст: 20, Группа: ИВ01

Доп задание:
Произвести вывод элементов отдельно на каждой строке и всех элементов единой строкой. 


* Output:
* Имя: Иван
* Фамилия: Иванов
* Возраст: 20
* Группа: ИВ01
*
* Имя: Иван, Фамилия: Иванов, Возраст: 20, Группа: ИВ01

*/

public class Task2 {
  public static void main(String args[]) {
  }
}

/*

Вспомогательные материалы:
https://metanit.com/java/tutorial/2.1.php
https://metanit.com/java/tutorial/2.9.php

*/